<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Default Language
    |--------------------------------------------------------------------------
    */
    'default' => 'ar',

    /*
    |--------------------------------------------------------------------------
    | Supported Languages
    |--------------------------------------------------------------------------
    | هنا يمكنك إضافة أي لغة جديدة بسهولة مستقبلاً.
    */
    'supported' => [
        'ar' => [
            'name' => 'العربية',
            'dir'  => 'rtl',
            'flag' => 'sa', // يمكن استخدامه لاحقاً للأيقونات
        ],
        'en' => [
            'name' => 'English',
            'dir'  => 'ltr',
            'flag' => 'us',
        ],
        'nl' => [
            'name' => 'Dutch',
            'dir'  => 'ltr',
            'flag' => 'nl',
        ],
    ],
];
